dimitarm1/stm_flash_prj/STM32F0_Discovery_IO_Toggle/src/main.c
void set_fan1(int value){
	//
//	uint32 counter = 0xFFFFFFF;
	uint32_t tim_base=7;
	TIM_Cmd(TIM2, DISABLE);

	zero_crossed = 0;
//	while (!zero_crossed && (counter--));
	switch(value){
	case 10:
		tim_base = 60; //Reverse polarity
		break;
	case 9:
		tim_base = 32;
		break;
	case 8:
		tim_base = 36;
		break;
	case 7:
		tim_base = 40;
		break;
	case 6:
		tim_base = 45;
		break;
	case 5:
		tim_base = 50;
		break;
	case 4:
		tim_base = 55;
		break;
	case 3:
		tim_base = 60;
		break;
	case 2:
		tim_base = 65;
		break;
	case 1:
	default:
		tim_base = 70;
		break;
	}
	if(value == 10) TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_Low;
	else  TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High;
	TIM_TimeBaseStructure.TIM_Period = tim_base;
	TIM_TimeBaseInit(TIM2, &TIM_TimeBaseStructure);

	/* TIM2 PWM2 Mode configuration: Channel4 */
	//for one pulse mode set PWM2, output enable, pulse (1/(t_wanted=TIM_period-TIM_Pulse)), set polarity high
	if (value)	TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
	else 	TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Disable;
	if (TIM_TimeBaseStructure.TIM_Period) TIM_OCInitStructure.TIM_Pulse = TIM_TimeBaseStructure.TIM_Period-5;
	else  TIM_OCInitStructure.TIM_Pulse = 9;

	TIM_OC4Init(TIM2, &TIM_OCInitStructure);
//	if (value) TIM_Cmd(TIM2, ENABLE);
//	else TIM_Cmd(TIM2, DISABLE);
	TIM_Cmd(TIM2, ENABLE);
}

void set_aquafresh(int value){

	if (value)	GPIOB->BSRR = GPIO_BSRR_BS_5;
	else GPIOB->BRR = GPIO_BSRR_BS_5;
}

void set_volume(int value){
	GPIOC->BRR = GPIO_BSRR_BS_2 | GPIO_BSRR_BS_3;
	if (value >8)	{
		GPIOC->BSRR = GPIO_BSRR_BS_2 | GPIO_BSRR_BS_3;
	}
	else if (value >5)	{
		GPIOC->BSRR =  GPIO_BSRR_BS_3;
	}
	else if (value >2)	{
		GPIOC->BSRR = GPIO_BSRR_BS_2 ;
	}
	else {
	}
}


void usart_receive(void){

	enum rxstates {rx_state_none, rx_state_pre_time, rx_state_main_time, rx_state_cool_time, rx_state_get_checksum};
	//	USART_ITConfig(USART1,USART_IT_RXNE,DISABLE);
	data =  USART_ReceiveData(USART1);

	//pre_time_sent = 0, main_time_sent = 0, cool_time_sent = 0;

	if ((data & 0x80)){
		// Command
		if((data & (0x0fU<<3U)) == ((controller_address & 0x0fU)<<3U)){
			Gv_UART_Timeout = 1500;
		}
		if((data == (0x80U | ((controller_address & 0x0fU)<<3U)))){
			data = (curr_status<<6)| ToBCD(curr_time);
//			data = (STATUS_WORKING<<6)|4;
			USART_SendData(USART1,data);
		}
		else if (data == ((0x80U | ((controller_address & 0x0fU)<<3U) ))+1) //Command 1 - Start
		{
			pre_time = 0;
			update_status();
		}
		else if (data == ((0x80U | ((controller_address & 0x0fU)<<3U) ))+2)  //Command 2 == Pre_time_set
		{
			rx_state = rx_state_pre_time;
		}
		else if (data == ((0x80U | ((controller_address & 0x0fU)<<3U)))+5) //Command 5 == Main_time_set
		{
			rx_state = rx_state_main_time;
		}
		else if (data == ((0x80U | ((controller_address & 0x0fU)<<3U)))+3) //Command 3 == Cool_time_set
		{
			rx_state = rx_state_cool_time;
		}

	} else if (rx_state){
		// payload
		int time_in_hex = ToBCD(main_time_sent);
		if(rx_state == rx_state_get_checksum){
			int checksum = (pre_time_sent + cool_time_sent  - time_in_hex - 5) & 0x7F;
			if(	data == checksum){
				pre_time = pre_time_sent;
				main_time = main_time_sent;
				cool_time = cool_time_sent;
				update_status();
				Gv_miliseconds = 0;
			}
			rx_state = 0;
		}
		if(rx_state == rx_state_pre_time){
			pre_time_sent = data;
			rx_state = 0;
		}
		if(rx_state == rx_state_main_time){
			main_time_sent = FromBCD(data);
			rx_state = 0;
		}
		if(rx_state == rx_state_cool_time){
			cool_time_sent = data;
			rx_state = rx_state_get_checksum;
			int checksum = (pre_time_sent + cool_time_sent  - time_in_hex - 5) & 0x7F;
			data = checksum;
			USART_SendData(USART1,data);
		}


	}
	//	USART_ITConfig(USART1,USART_IT_RXNE,ENABLE);
	//	USART_SendData(USART1,0x80);
}

void play_message(int index){
	if(disk_status(0) == STA_NOINIT) return;

	dac_current_message = index;
	dac_out_counter = 511;
	disk_read(0, dac_buffer[dac_ping_pong_state], message_sector_offset[index], 2) ;
	dac_current_block = 2;
	TIM6->CR1 |= TIM_CR1_CEN;
	TIM6->DIER |= TIM_DIER_UIE; // Enable interrupt on update event
	dac_ping_pong_state = 0;
	dac_fade_in_counter = 10 * volume[0];
}

void I2C_MCP_send_byte(I2C_TypeDef* I2Cx, char data)
{
	int address = 0x2F; // MCP4018's fixed address
	int length = 1;
	while ((I2Cx->ISR & I2C_ISR_TXE)==0);    //while TXE ==0, buffer is full
	I2Cx->CR2|=(address<<0)|(length<<16)| I2C_CR2_AUTOEND ;    //address SLAVE 7bits
	I2Cx->CR2 &=~ I2C_CR2_RD_WRN;                        //write
	I2Cx->CR2 |= I2C_CR2_START;
	while ((I2Cx->ISR & I2C_ISR_TXE)==0);    //while TXE ==0, buffer is full
	I2Cx->TXDR=data;//example data
}

void set_pot_level(int channel, char level){
	switch(channel){
	case 1:
		i2c_config_1();
		I2C_MCP_send_byte(I2C1, level);
	case 2:
		i2c_config_1();
		I2C_MCP_send_byte(I2C2, level);
		break;
	case 3:
		i2c_config_2();
		I2C_MCP_send_byte(I2C1, level);
	case 4:
		i2c_config_2();
		I2C_MCP_send_byte(I2C2, level);
		break;
	default:
		break;

	}
}

void TIM6_DAC_IRQHandler() {
	if((TIM6->SR & TIM_SR_UIF) != 0) // If update flag is set
	{
//		static int dummy = 0;
//		if (!dummy) dummy = 255;
//		else dummy = 0;
//		DAC_SetChannel1Data(DAC_Align_8b_R, dummy);
//		goto finish_TIM6_isr;

		if(dac_fade_in_counter){
			dac_fade_in_counter--;
			if(!(dac_fade_in_counter%100)){
				set_pot_level(3, dac_fade_in_counter/10);
				set_pot_level(4, dac_fade_in_counter/10);
			}
			if(!dac_fade_in_counter){
				set_pot_level(1, 50);
				set_pot_level(2, 50);
			}
			goto finish_TIM6_isr;
		}

		if(dac_fade_out_counter){
			dac_fade_out_counter--;
			if(!(dac_fade_out_counter%100)){
				set_pot_level(3, volume[2] - dac_fade_out_counter/10);
				set_pot_level(4, volume[2] - dac_fade_out_counter/10);
			}
			if(!dac_fade_out_counter<=0){
				//TIM6->DIER &= ~TIM_DIER_UIE; // Disable interrupt on update event
				TIM_Cmd(TIM6, DISABLE);
			}
			goto finish_TIM6_isr;
		}

		DAC_SetChannel1Data(DAC_Align_8b_R, dac_buffer[dac_ping_pong_state][dac_out_counter]);

		if(dac_out_counter<512){
			dac_out_counter++;
		} else {
			dac_out_counter = 0;
			dac_ping_pong_state = !dac_ping_pong_state;

			if (dac_current_block < message_sector_counts[dac_current_message]){
				disk_read(0, dac_buffer[dac_ping_pong_state], message_sector_offset[dac_current_message] + dac_current_block, 2) ;
			} else if (dac_current_block > message_sector_counts[dac_current_message]){
				dac_fade_out_counter = 10 * volume[2];
			}
			dac_current_block++;
			dac_ping_pong_state = !dac_ping_pong_state;
		}
	}
	finish_TIM6_isr:
	TIM6->SR &= ~TIM_SR_UIF; // Interrupt has been handled }
}




/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
